Repository: fmontesdev/frontend_flutter_aulasegura
Catalog: lib/core/l10n/app_*.arb
Languages: ca, es

# enterEmail
source: Enter your email
ca: Introdueix el teu email
es: Introduce tu email

# emailValidation
source: Invalid email
ca: Email no vàlid
es: Email no válido

# emailHintText
source: example@domain.com
ca: exemple@domini.com
es: ejemplo@dominio.com

# enterPassword
source: Enter your password
ca: Introdueix la teva contrasenya
es: Introduce tu contraseña

# passwordValidation
source: Minimum 8 characters, with uppercase, lowercase, and number
ca: Mínim 8 caràcters, amb majúscula, minúscula, i número
es: Mínimo 8 caracteres, con mayúscula, minúscula, y número

source: Recover password
ca: Recuperar contrasenya
es: Recuperar contraseña

# descriptionLabel
source: Description
ca: Descripció
es: Descripción

# descriptionHintText
source: Add a description...
ca: Afegeix una descripció...
es: Añade una descripción...

# checkFields
source: Check the fields
ca: Revisa els camps
es: Revisa los campos

# loginError
source: We couldn't log in: {error, select, User_not_found{User not found} Incorrect_password{Incorrect password} other{error}}
ca: No s'ha pogut iniciar sessió: {error, select, User_not_found{Usuari no trobat} Incorrect_password{Contrasenya incorrecta} other{error}}
es: No se pudo iniciar sesión: {error, select, User_not_found{Usuario no encontrado} Incorrect_password{Contraseña incorrecta} other{error}}

# forgotPassword
source: Did you forget your password?
ca: Has oblidat la contrasenya?
es: ¿Se te olvidó la contraseña?

source: Log in
ca: Inicia sessió
es: Inicia sesión

source: Show
ca: Mostrar
es: Mostrar

source: Hide
ca: Amagar
es: Ocultar

# page
source: {pageName, select, home{Home} map{Map} reservations{Reservations} schedules{Schedules} notifications{Notifications} other{Unknown}}
ca: {pageName, select, home{Inici} map{Mapa} reservations{Reserves} schedules{Horaris} notifications{Notificacions} other{Desconegut}}
es: {pageName, select, home{Inicio} map{Mapa} reservations{Reservas} schedules{Horarios} notifications{Notificaciones} other{Desconocido}}

# profile
source: My profile
ca: El meu perfil
es: Mi perfil

# sessionError
source: Session error: {error}
ca: Error de sessió: {error}
es: Error de sesión: {error}

# salute
source: Hello {userName}!
ca: Hola {userName}!
es: Hola {userName}!

# role
source: {rolName, select, admin{Administrator} teacher{Teacher} janitor{Janitor} support_staff{Support staff} other{Unknown}}
ca: {rolName, select, admin{Administrador} teacher{Professor} janitor{Conserge} support_staff{Personal auxiliar} other{Desconegut}}
es: {rolName, select, admin{Administrador} teacher{Profesor} janitor{Conserje} support_staff{Personal auxiliar} other{Desconocido}}

source: NFC access
ca: Accés per NFC
es: Acceso por NFC

source: QR Access
ca: Accés QR
es: Acceso QR

source: Today
ca: Hui
es: Hoy

# reservationSelectorOption
source: {nameOption, select, approved{Approved} pending{Pending} revoked{Revoked} other{Unknown}}
ca: {nameOption, select, approved{Aprobades} pending{Pendents} revoked{Cancel·lades} other{Desconegut}}
es: {nameOption, select, approved{Aprobadas} pending{Pendientes} revoked{Canceladas} other{Desconocido}}

source: Request reservation
ca: Sol·licitar reserva
es: Solicitar reserva

source: Delete
ca: Eliminar
es: Eliminar

source: Schedule
ca: Horari
es: Horario

source: Search for available classrooms
ca: Buscar aules disponibles
es: Buscar aulas disponibles

# dayOfWeek
source: {dayName, select, monday{Mon.} tuesday{Tues.} wednesday{Wed.} thursday{Thurs.} friday{Fri.} other{Unknown}}
ca: {dayName, select, monday{Dilluns} tuesday{Dimarts} wednesday{Dimec.} thursday{Dijous} friday{Divend.} other{Desconegut}}
es: {dayName, select, monday{Lunes} tuesday{Martes} wednesday{Miérc.} thursday{Jueves} friday{Viernes} other{Desconocido}}

# loadingSchedulesError
source: Loading schedules error: {error}
ca: Error carregant horaris: {error}
es: Error cargando horarios: {error}

# notificationSelectorOption
source: {nameOption, select, pending{Pend.} access{Access} notice{Notice} warning{Warning} all{All} other{Unknown}}
ca: {nameOption, select, pending{Pend.} access{Accessos} notice{Avisos} warning{Alertes} all{Totes} other{Desconegut}}
es: {nameOption, select, pending{Pend.} access{Accesos} notice{Avisos} warning{Alertas} all{Todas} other{Desconocido}}

# markAllAsRead
source: Mark all as read ({pendingCount})
ca: Marcar totes com a llegides ({pendingCount})
es: Marcar todas como leídas ({pendingCount})

# allMarkedAsRead
source: All notifications marked as read
ca: Totes les notificacions marcades com a llegides
es: Todas las notificaciones marcadas como leídas

# loadingNotificationsError
source: Loading notifications error: {error}
ca: Error carregant notificacions: {error}
es: Error cargando notificaciones: {error}

# notiMarkedAsRead
source: Notification marked as read
ca: Notificació marcada com a llegida
es: Notificación marcada como leida

source: Undo
ca: Desfer
es: Deshacer

# notificationTitle
source: {nameTitle, select, approved{Access approved} denied{Access denied} notice{General notice} warning{Warning} other{Unknown}}
ca: {nameTitle, select, approved{Accés aprovat} denied{Accés denegat} notice{Avís general} warning{Alerta} other{Desconegut}}
es: {nameTitle, select, approved{Acceso aprobado} denied{Acceso denegado} notice{Aviso general} warning{Alerta} other{Desconocido}}

source: Mark as read
ca: Marcar com a llegida
es: Marcar como leida

# department
source: {departmentName, select, artes_plasticas{Visual Arts} biologia_y_geologia{Biology and Geology} economia{Economics} educacion_fisica{Physical Education} administracion{Business Administration} comercio{Commerce} informatica{Computer Science} filosofia{Philosophy} fisica_y_quimica{Physics and Chemistry} fol{Fol} frances{French} geografia_e_historia{Geography and History} ingles{English} latin{Latin} castellano{Spanish} valenciano{Valencian} matematicas{Mathematics} musica{Music} orientacion{Guidance} religion{Religion} tecnologia{Technology} other{Unknown}}
ca: {departmentName, select, artes_plasticas{Arts Plàstiques} biologia_y_geologia{Biologia i Geologia} economia{Economia} educacion_fisica{Educació Física} administracion{Administració} comercio{Comerç} informatica{Informàtica} filosofia{Filosofia} fisica_y_quimica{Física i Química} fol{Fol} frances{Francés} geografia_e_historia{Geografia i Història} ingles{Anglés} latin{Llatí} castellano{Castellà} valenciano{Valencià} matematicas{Matemàtiques} musica{Música} orientacion{Orientació} religion{Religió} tecnologia{Tecnologia} other{Desconegut}}
es: {departmentName, select, artes_plasticas{Artes Plásticas} biologia_y_geologia{Biología y Geología} economia{Economía} educacion_fisica{Educación Física} administracion{Administración} comercio{Comercio} informatica{Informática} filosofia{Filosofía} fisica_y_quimica{Física y Química} fol{Fol} frances{Francés} geografia_e_historia{Geografía e Historia} ingles{Inglés} latin{Latín} castellano{Castellano} valenciano{Valenciano} matematicas{Matemáticas} musica{Música} orientacion{Orientación} religion{Religión} tecnologia{Tecnología} other{Desconocido}}

source: Log out
ca: Tancar sessió
es: Cerrar sesión

source: Security
ca: Seguretat
es: Seguridad

source: Change password
ca: Canviar contrasenya
es: Cambiar contraseña

# updatePassword
source: Update your password
ca: Actualitza la teva contrasenya
es: Actualiza tu contraseña

source: Current password
ca: Contrasenya actual
es: Contraseña actual

source: New password
ca: Nova contrasenya
es: Nueva contraseña

source: Confirm password
ca: Confirmar contrasenya
es: Confirmar contraseña

source: Passwords do not match
ca: Les contrasenyes no coincideixen
es: Las contraseñas no coinciden

# newPasswordMustBeDifferent
source: New password must be different from current password
ca: La nova contrasenya ha de ser diferent de l'actual
es: La nueva contraseña debe ser diferente a la actual

# passwordStrength
source: {strength, select, weak{Weak} medium{Medium} strong{Strong} other{Unknown}}
ca: {strength, select, weak{Feble} medium{Mitjana} strong{Forta} other{Desconeguda}}
es: {strength, select, weak{Débil} medium{Media} strong{Fuerte} other{Desconocida}}

source: Save changes
ca: Guardar canvis
es: Guardar cambios

source: Saving...
ca: Guardant...
es: Guardando...

source: Password changed successfully
ca: Contrasenya canviada correctament
es: Contraseña cambiada correctamente

# changePasswordError
source: Could not change password: {error, select, Incorrect_current_password{Incorrect current password} other{error}}
ca: No s'ha pogut canviar la contrasenya: {error, select, Incorrect_current_password{Contrasenya actual incorrecta} other{error}}
es: No se pudo cambiar la contraseña: {error, select, Incorrect_current_password{Contraseña actual incorrecta} other{error}}

source: Requirements
ca: Requisits
es: Requisitos

# minimumCharacters
source: Minimum 8 characters
ca: Mínim 8 caràcters
es: Mínimo 8 caracteres

source: One uppercase letter
ca: Una lletra majúscula
es: Una letra mayúscula

source: One lowercase letter
ca: Una lletra minúscula
es: Una letra minúscula

source: One number
ca: Un número
es: Un número

source: Preferences
ca: Preferències
es: Preferencias

source: Dark theme
ca: Tema fosc
es: Tema oscuro

source: Light theme
ca: Tema clar
es: Tema claro

source: Home
ca: Inici
es: Inicio

# bringPhoneCloser
source: Bring your phone closer to the reader
ca: Apropa el teu mòbil al lector
es: Acerca tu móvil al lector

source: Validating access...
ca: Validant accés...
es: Validando acceso...

source: Access granted
ca: Accés permès
es: Acceso permitido

source: Access denied
ca: Accés denegat
es: Acceso denegado

# accessAt
source: Access at {time}
ca: Accés a les {time}
es: Acceso a las {time}

source: NFC disabled
ca: NFC deshabilitat
es: NFC deshabilitado

# enableNfcMessage
source: Please enable NFC in your device settings
ca: Si us plau, habilita NFC a la configuració del teu dispositiu
es: Por favor, habilita NFC en la configuración de tu dispositivo

source: Open settings
ca: Obrir configuració
es: Abrir configuración

# accessTimeout
source: Timeout exceeded
ca: Temps d'espera esgotat
es: Tiempo de espera agotado

source: Understood
ca: Entès
es: Entendido

# onOff
source: {boolean, select, true{On} false{Off} other{Unknown}}
ca: {boolean, select, true{Activat} false{Desactivat} other{Desconegut}}
es: {boolean, select, true{Activado} false{Desactivado} other{Desconocido}}

source: Language
ca: Idioma
es: Idioma

# languageName
source: {languageTag, select, es{Spanish} ca{Valencian} en{English} other{Unknown}}
ca: {languageTag, select, es{Castellà} ca{Valencià} en{Anglés} other{Desconegut}}
es: {languageTag, select, es{Castellano} ca{Valenciano} en{Inglés} other{Desconocido}}

source: Notifications
ca: Notificacions
es: Notificaciones

# onOffFemeninPlural
source: {boolean, select, true{On} false{Off} other{Unknown}}
ca: {boolean, select, true{Activades} false{Desactivades} other{Desconegut}}
es: {boolean, select, true{Activadas} false{Desactivadas} other{Desconocido}}

source: Development
ca: Desenvolupament
es: Desarrollo

source: Widget Catalog
ca: Catàleg de Widgets
es: Catálogo de Widgets

# exploreComponents
source: Explore the app components
ca: Explora els components de l'app
es: Explora los componentes de la app

source: Lists and Tiles
ca: Llistes i Tiles
es: Listas y Tiles

source: Selectable tiles with switch
ca: Tiles seleccionables i amb switch
es: Tiles seleccionables y con switch

source: Horizontal slide selectors
ca: Selectors lliscants horitzontals
es: Selectores deslizables horizontales

source: Calendars
ca: Calendaris
es: Calendarios

source: Monthly calendar with selection
ca: Calendari mensual amb selecció
es: Calendario mensual con selección

# iconOptionTile
source: List with icons
ca: Llista amb icones
es: Lista con iconos

# selectableTile
source: Selectable list
ca: Llista seleccionable
es: Lista seleccionable

# activated
source: On
ca: Activat
es: Activado

# deactivated
source: Off
ca: Desactivat
es: Desactivado

# activatedFeminine
source: On
ca: Activades
es: Activadas

# deactivatedFeminine
source: Off
ca: Desactivades
es: Desactivadas

source: Simple Selector
ca: Selector Simple
es: Selector Simple

source: Single element selection
ca: Selecció única d'elements
es: Selección única de elementos

source: Multiple Selector
ca: Selector Múltiple
es: Selector Múltiple

source: Multiple element selection
ca: Selecció múltiple d'elements
es: Selección múltiple de elementos

source: Selected
ca: Seleccionat
es: Seleccionado

# selectedPlural
source: Selected
ca: Seleccionats
es: Seleccionados

source: Table Calendar
ca: Calendari en format taula
es: Calendario en formato tabla

source: Monthly calendar with day selection
ca: Calendari mensual amb selecció de dies
es: Calendario mensual con selección de días

source: Selected date
ca: Data seleccionada
es: Fecha seleccionada

source: Date
ca: Data
es: Fecha

source: Component Catalog
ca: Catàleg de Components
es: Catálogo de Componentes

source: Buttons
ca: Botons
es: Botones

source: Variants, states and sizes
ca: Variants, estats i mides
es: Variantes, estados y tamaños

source: Text Inputs
ca: Inputs de Text
es: Inputs de Texto

source: Variants and validations
ca: Variants i validacions
es: Variantes y validaciones

source: Links
ca: Enllaços

source: Secondary action links
ca: Enllaços d'acció secundaris
es: Enlaces de acción secundarios

source: Cards
ca: Targetes

source: Different cards with content
ca: Diferents targetes amb contingut
es: Diferentes tarjetas con contenido

source: Filters
ca: Filtres
es: Filtros

source: Different types of filters
ca: Diferents tipus de filtres
es: Diferentes tipos de filtros

source: Primary color button
ca: Botó color primari
es: Botón color primario

source: Secondary color button
ca: Botó color secundari
es: Botón color secundario

source: Danger color button
ca: Botó color perill
es: Botón color peligro

source: Home page buttons
ca: Botons de la pàgina d'inici
es: Botones de la página de inicio

# floatingActionButton
source: Floating Action Button (FAB)
ca: Botó d'acció flotant (FAB)
es: Botón de acción flotante (FAB)

source: Small
ca: Petit
es: Pequeño

source: Medium
ca: Mitjà
es: Mediano

source: Large
ca: Gran
es: Grande

source: Password (toggle show/hide)
ca: Contrasenya (canviar mostrar/ocultar)
es: Contraseña (toggle mostrar/ocultar)

source: Multiline
ca: Multilínia
es: Multilínea

source: Validate inputs
ca: Validar inputs
es: Validar inputs

source: Enter your email
ca: Introdueix el teu email
es: Introduce tu email

source: Invalid email
ca: Email no vàlid
es: Email no válido

source: Enter your password
ca: Introdueix la teva contrasenya
es: Introduce tu contraseña

source: Minimum 8 characters
ca: Mínim 8 caràcters
es: Mínimo 8 caracteres

# enterDescription
source: Enter a description
ca: Introdueix una descripció
es: Introduce una descripción

source: Review fields
ca: Revisa els camps
es: Revisa los campos

source: Validated correctly
ca: Validat correctament
es: Validado correctamente

source: Left aligned small link
ca: Enllaç a l'esquerra petit
es: Enlace a la izquierda pequeño

source: Centered medium link
ca: Enllaç centrat mitjà
es: Enlace centrado mediano

source: Right aligned large link
ca: Enllaç a la dreta gran
es: Enlace a la derecha grande

source: Welcome card
ca: Targeta de benvinguda
es: Card de bienvenida

source: Schedule card
ca: Targeta d'horari
es: Card de horario

source: Notification card
ca: Targeta de notificació
es: Card de notificación

source: Selector of 5 filters
ca: Selector de 5 filtres
es: Selector de 5 filtros

source: Selector of 2 filters
ca: Selector de 2 filtres
es: Selector de 2 filtros

source: Monday
ca: Dilluns
es: Lunes

source: Tuesday
ca: Dimarts
es: Martes

source: Wednesday
ca: Dimecres
es: Miércoles

source: Thursday
ca: Dijous
es: Jueves

source: Friday
ca: Divendres
es: Viernes

source: Saturday
ca: Dissabte
es: Sábado

source: Sunday
ca: Diumenge
es: Domingo

source: Room
ca: Aula
es: Aula

source: Building
ca: Edifici
es: Edificio

source: Floor
ca: Planta
es: Planta

source: User not authenticated
ca: Usuari no autenticat
es: Usuario no autenticado

source: Classroom reservation
ca: Reserva d'aula
es: Reserva de aula

source: Reservation created successfully
ca: Reserva creada correctament
es: Reserva creada correctamente

source: Error creating reservation
ca: Error en crear la reserva
es: Error al crear la reserva

# pleaseSelectDate
source: Please select a date
ca: Si us plau selecciona una data
es: Por favor selecciona una fecha

# pleaseSelectSchedule
source: Please select a schedule
ca: Si us plau selecciona un horari
es: Por favor selecciona un horario

source: No available classrooms
ca: No hi ha aules disponibles
es: No hay aulas disponibles

source: Error loading time slots
ca: Error carregant franges horàries
es: Error cargando franjas horarias

source: No schedule for this time
ca: No hi ha horari per a aquesta hora
es: No hay horario para esta hora

source: Outside scheduled time
ca: Fora de l'horari programat
es: Fuera del horario programado

source: Inactive permission
ca: Permís inactiu
es: Permiso inactivo

source: User not found
ca: Usuari no trobat
es: Usuario no encontrado

source: Reader not found
ca: Lector no trobat
es: Lector no encontrado

# accessTime
source: Access at
ca: Accés a les
es: Acceso a las

# focusQrCode
source: Focus the reader's QR code
ca: Enfoca el codi QR del lector
es: Enfoca el código QR del lector

# accessDenialReason
source: {reason, select, Tag_not_found{Tag not found} Inactive_tag{Inactive tag} The_NFC_does_not_belong_to_the_authenticated_user{NFC tag does not belong to authenticated user} Reader_not_found{Reader not found} Inactive_reader{Inactive reader} No_valid_permission_found{No valid permission found} Internal_error_while_validating_access{Internal error while validating access} other{Unknown reason}}
ca: {reason, select, Tag_not_found{Targeta no trobada} Inactive_tag{Targeta inactiva} The_NFC_does_not_belong_to_the_authenticated_user{La targeta NFC no pertany a l'usuari autenticat} Reader_not_found{Lector no trobat} Inactive_reader{Lector inactiu} No_valid_permission_found{No s'ha trobat un permís vàlid} Internal_error_while_validating_access{Error intern al validar l'accés} other{Motiu desconegut}}
es: {reason, select, Tag_not_found{Tarjeta no encontrada} Inactive_tag{Tarjeta inactiva} The_NFC_does_not_belong_to_the_authenticated_user{La tarjeta NFC no pertenece al usuario autenticado} Reader_not_found{Lector no encontrado} Inactive_reader{Lector inactivo} No_valid_permission_found{No se encontró un permiso válido} Internal_error_while_validating_access{Error interno al validar el acceso} other{Motivo desconocido}}

source: Reservation deleted
ca: Reserva eliminada
es: Reserva eliminada

source: Error loading reservations
ca: Error carregant reserves
es: Error cargando reservas

source: Selectors
es: Selectores

source: Components
es: Componentes
